sqlite3 survey.db

In [2]:
import sqlite3
import pandas as pd

conexao = sqlite3.connect('/home/fernando/github/python-datascience/survey.db')

In [11]:
pessoa = pd.read_sql_query("SELECT * FROM person", conexao)
pessoa.info()
pessoa.describe()
print(pessoa)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        5 non-null      object
 1   personal  5 non-null      object
 2   family    5 non-null      object
dtypes: object(3)
memory usage: 248.0+ bytes
         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [13]:


dfsite = pd.read_sql_query("SELECT * FROM Site", conexao)
print(dfsite.describe())
print(dfsite)

             lat        long
count   3.000000    3.000000
mean  -48.623333 -126.230000
std     1.366797    2.619599
min   -49.850000 -128.570000
25%   -49.360000 -127.645000
50%   -48.870000 -126.720000
75%   -48.010000 -125.060000
max   -47.150000 -123.400000
    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [15]:
dfvisited=pd.read_sql_query("SELECT max(id) FROM Visited;", conexao)
print(dfvisited)

dfvisited=pd.read_sql_query("SELECT * FROM Visited;", conexao)
print(dfvisited['id'].max())

   max(id)
0      844
844

In [4]:
# Selecionando colunas

dfPerson = pd.read_sql_query("SELECT family, personal FROM Person;", conexao)
print(dfPerson)
dfSurvey = pd.read_sql_query("SELECT * FROM Survey;", conexao)
print(dfSurvey)
print(dfPerson['family'])

     family   personal
0      Dyer    William
1   Pabodie      Frank
2      Lake   Anderson
3   Roerich  Valentina
4  Danforth      Frank
    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735   None   sal     0.06
9     735   None  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25
0        Dyer
1     Pabodie
2        Lake
3     Roerich
4    Danforth
Name: family, dtype: object

In [6]:
dfSurvey = pd.read_sql_query("SELECT quant FROM Survey", conexao)
print(dfSurvey)

   quant
0    rad
1    sal
2    rad
3    sal
4    rad
5    sal
6   temp
7    rad
8    sal
9   temp
10   rad
11  temp
12   sal
13   rad
14   sal
15  temp
16   sal
17   rad
18   sal
19   sal
20   rad

In [8]:
#distinct - opção para remover registros com valores repetidos de uma coluna específica
dfSurvey = pd.read_sql_query("SELECT DISTINCT quant FROM Survey;", conexao)
print(dfSurvey)

dfSurvey = pd.read_sql_query("SELECT * FROM Survey;", conexao)
print(dfSurvey['quant'])
print(dfSurvey['quant'].unique())

  quant
0   rad
1   sal
2  temp
0      rad
1      sal
2      rad
3      sal
4      rad
5      sal
6     temp
7      rad
8      sal
9     temp
10     rad
11    temp
12     sal
13     rad
14     sal
15    temp
16     sal
17     rad
18     sal
19     sal
20     rad
Name: quant, dtype: object
['rad' 'sal' 'temp']

In [10]:
dfSurvey = pd.read_sql_query("SELECT DISTINCT taken, quant FROM Survey;", conexao)
print(dfSurvey)

    taken quant
0     619   rad
1     619   sal
2     622   rad
3     622   sal
4     734   rad
5     734   sal
6     734  temp
7     735   rad
8     735   sal
9     735  temp
10    751   rad
11    751  temp
12    751   sal
13    752   rad
14    752   sal
15    752  temp
16    837   rad
17    837   sal
18    844   rad

In [12]:
#ordenando
dfPerson = pd.read_sql_query("SELECT * FROM person ORDER BY id  ASC;", conexao)
print(dfPerson)

         id   personal    family
0  danforth      Frank  Danforth
1      dyer    William      Dyer
2      lake   Anderson      Lake
3        pb      Frank   Pabodie
4       roe  Valentina   Roerich

In [14]:
#ordenando com Pandas
dfPerson = pd.read_sql_query("SELECT * FROM person", conexao)
print(dfPerson)
print(dfPerson.sort_values(by=['id']))

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth
         id   personal    family
4  danforth      Frank  Danforth
0      dyer    William      Dyer
2      lake   Anderson      Lake
1        pb      Frank   Pabodie
3       roe  Valentina   Roerich